Catalogs/НаправленияДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НаправленияДеятельности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетУчетаВыручкиОтПродаж</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаСебестоимостиПродаж</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаПрибыли</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизацияВнеоборотныхАктивов</Name>
					<Comment>02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеоборотныеАктивы</Name>
					<Comment>01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаСчетов</Name>
					<Comment>Служебный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторы</Name>
					<Comment>62.01, 60.02, 68.02, 71.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
					<Comment>50, 51, 57</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныеОбязательства</Name>
					<Comment>67</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запасы</Name>
					<Comment>10, 41</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитал</Name>
					<Comment>80</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КосвенныеЗатраты</Name>
					<Comment>25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КраткосрочныеФинансовыеВложения</Name>
					<Comment>58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторы</Name>
					<Comment>60.01, 62.02, 68.01, 70.01, 71.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитыИЗаймы</Name>
					<Comment>66</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
					<Comment>20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НераспределеннаяПрибыль</Name>
					<Comment>84</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибылиУбытки</Name>
					<Comment>99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВнеоборотныеАктивы</Name>
					<Comment>08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКраткосрочныеОбязательства</Name>
					<Comment>98</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОборотныеАктивы</Name>
					<Comment>94, 97</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Comment>91.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
					<Comment>90.07, 90.08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервныйИДобавочныйКапитал</Name>
					<Comment>82</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродаж</Name>
					<Comment>90.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговаяНаценка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НаправленияДеятельности/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СчетЗатрат") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СчетЗатрат) Тогда
			
			Если Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			   И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			   И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
				
				ТекстСообщения = НСтр("ru='Для данного типа счета направление деятельности не указывается!';uk='Для даного типу рахунку напрямок діяльності не вказується!'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(, ТекстСообщения, , , , Отказ);
				
			КонецЕсли;
			
		Иначе
			
			ТекстСообщения = НСтр("ru='Не выбран счет!';uk='Не обраний рахунок!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(, ТекстСообщения, , , , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
